//#include <stdio.h>
//
//int main()
//{
//
//	//진수 표기: 10진수, 2진수, 16진수
//	int num = 10;
//	int bNum = 0b1010;	//2진수는 접두어가 0b 를 붙인다.
//	int hNum = 0xA;	//16진수는 접두어 0x 를 붙인다.
//
//	printf("%d\n", num);
//	printf("%d\n", bNum);
//	printf("%d\n", hNum);
//
//	// 음의 정수 표기
//	// 음의 정수로 전환 방법: 1. 1의 보수로 바꾼다.(0을 1로, 1을 0으로)
//	//						2. 1의 보수의 결과에 1을 더한다.
//	int num1 = 0b00000000000000000000000000000101; // 5
//	int num2 = 0b11111111111111111111111111111011; // -5
//
//	printf("%d\n", num1);
//	printf("%d\n", num2);
//	
//
//
//	return 0;
//}
