//#include <stdio.h>
//
//int main()
//{
//	//int a = 1;
//	//printf("a = %d\n", a);
//
//	//a++;	//a = a + 1
//	//printf("a = %d\n", a);
//
//	//a++;	//a = a + 1
//	//printf("a = %d\n", a);
//
//	// "안녕~"을 10번 반복하기
//	int n = 1;
//	//printf("안녕~ %d\n", n++);	// ++ 이 n의 앞과 뒤 모두에 올 수 있다.
//	//printf("안녕~ %d\n", n++);	// ++ 이 n의 앞과 뒤 모두에 올 수 있다.
//	//printf("안녕~ %d\n", n++);	// ++ 이 n의 앞과 뒤 모두에 올 수 있다.
//	//printf("안녕~ %d\n", n++);	// ++ 이 n의 앞과 뒤 모두에 올 수 있다.
//	//printf("안녕~ %d\n", n++);	// ++ 이 n의 앞과 뒤 모두에 올 수 있다.
//	//printf("안녕~ %d\n", n++);	// ++ 이 n의 앞과 뒤 모두에 올 수 있다.
//	//printf("안녕~ %d\n", n++);	// ++ 이 n의 앞과 뒤 모두에 올 수 있다.
//	//printf("안녕~ %d\n", n++);	// ++ 이 n의 앞과 뒤 모두에 올 수 있다.
//	//printf("안녕~ %d\n", n++);	// ++ 이 n의 앞과 뒤 모두에 올 수 있다.
//	//printf("안녕~ %d\n", n++);	// ++ 이 n의 앞과 뒤 모두에 올 수 있다.
//	
//	while (n <= 10)	//조건식(종료값)
//	{
//		printf("안녕~ %d\n", n);
//		n++;
//	}
//
//	printf("\n");
//
//	n = 10;
//	while (n > 0)
//	{
//		printf("안녕~%d\n", n);
//		n--;
//	}
//
//	printf("\n");
//
//	//	1부터 10까지 합계 계산하기
//	int i = 0, hap = 0;
//	
//	while (i < 11)
//	{
//		
//		hap += i;	// hap = hap + i;
//		printf("i=%d, hap=%d\n", i, hap);
//		i++;
//		
//	}
//	printf("i=%d, hap=%d\n", i, hap);
//
//	return 0;
//}